In [1]:
import pandas as pd
rental = pd.read_csv(r"Desktop\raw_rental.csv")

In [3]:
rental.head()

,first_name,last_name,email,rental_date,store_id,address_id,film_title
0,JOEL,FRANCISCO,JOEL.FRANCISCO@sakilacustomer.org,2005-07-08 19:03:15,2,436,ACADEMY DINOSAUR
1,GABRIEL,HARDER,GABRIEL.HARDER@sakilacustomer.org,2005-08-02 20:13:10,1,524,ACADEMY DINOSAUR
2,DIANNE,SHELTON,DIANNE.SHELTON@sakilacustomer.org,2005-08-21 21:27:43,2,284,ACADEMY DINOSAUR
3,NORMAN,CURRIER,NORMAN.CURRIER@sakilacustomer.org,2005-05-30 20:21:07,1,416,ACADEMY DINOSAUR
4,BEATRICE,ARNOLD,BEATRICE.ARNOLD@sakilacustomer.org,2005-06-17 20:24:00,1,174,ACADEMY DINOSAUR

In [4]:
rental.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   first_name   1000 non-null   object
 1   last_name    1000 non-null   object
 2   email        1000 non-null   object
 3   rental_date  1000 non-null   object
 4   store_id     1000 non-null   int64
 5   address_id   1000 non-null   int64
 6   film_title   1000 non-null   object
dtypes: int64(2), object(5)
memory usage: 54.8+ KB

In [6]:
rental["email"] =rental["email"].str.lower()

In [7]:
rental.head()

,first_name,last_name,email,rental_date,store_id,address_id,film_title
0,JOEL,FRANCISCO,joel.francisco@sakilacustomer.org,2005-07-08 19:03:15,2,436,ACADEMY DINOSAUR
1,GABRIEL,HARDER,gabriel.harder@sakilacustomer.org,2005-08-02 20:13:10,1,524,ACADEMY DINOSAUR
2,DIANNE,SHELTON,dianne.shelton@sakilacustomer.org,2005-08-21 21:27:43,2,284,ACADEMY DINOSAUR
3,NORMAN,CURRIER,norman.currier@sakilacustomer.org,2005-05-30 20:21:07,1,416,ACADEMY DINOSAUR
4,BEATRICE,ARNOLD,beatrice.arnold@sakilacustomer.org,2005-06-17 20:24:00,1,174,ACADEMY DINOSAUR

In [8]:
print(rental.isnull().sum())

first_name     0
last_name      0
email          0
rental_date    0
store_id       0
address_id     0
film_title     0
dtype: int64

In [10]:
rental.drop('rental_date',  axis=1, inplace=True)

In [12]:
rental.head()

,first_name,last_name,email,store_id,address_id,film_title
0,JOEL,FRANCISCO,joel.francisco@sakilacustomer.org,2,436,ACADEMY DINOSAUR
1,GABRIEL,HARDER,gabriel.harder@sakilacustomer.org,1,524,ACADEMY DINOSAUR
2,DIANNE,SHELTON,dianne.shelton@sakilacustomer.org,2,284,ACADEMY DINOSAUR
3,NORMAN,CURRIER,norman.currier@sakilacustomer.org,1,416,ACADEMY DINOSAUR
4,BEATRICE,ARNOLD,beatrice.arnold@sakilacustomer.org,1,174,ACADEMY DINOSAUR

In [13]:
rental.drop('store_id',  axis=1, inplace=True)

In [14]:
rental.head()

,first_name,last_name,email,address_id,film_title
0,JOEL,FRANCISCO,joel.francisco@sakilacustomer.org,436,ACADEMY DINOSAUR
1,GABRIEL,HARDER,gabriel.harder@sakilacustomer.org,524,ACADEMY DINOSAUR
2,DIANNE,SHELTON,dianne.shelton@sakilacustomer.org,284,ACADEMY DINOSAUR
3,NORMAN,CURRIER,norman.currier@sakilacustomer.org,416,ACADEMY DINOSAUR
4,BEATRICE,ARNOLD,beatrice.arnold@sakilacustomer.org,174,ACADEMY DINOSAUR

In [15]:
rental.drop('address_id',  axis=1, inplace=True)

In [16]:
rental.head()

  first_name  last_name                               email        film_title
0       JOEL  FRANCISCO   joel.francisco@sakilacustomer.org  ACADEMY DINOSAUR
1    GABRIEL     HARDER   gabriel.harder@sakilacustomer.org  ACADEMY DINOSAUR
2     DIANNE    SHELTON   dianne.shelton@sakilacustomer.org  ACADEMY DINOSAUR
3     NORMAN    CURRIER   norman.currier@sakilacustomer.org  ACADEMY DINOSAUR
4   BEATRICE     ARNOLD  beatrice.arnold@sakilacustomer.org  ACADEMY DINOSAUR

In [18]:
rental.duplicated().sum()

9

In [19]:
rental.shape

(1000, 4)

In [20]:
rental = rental.drop_duplicates()

In [21]:
rental.shape

(991, 4)

In [23]:
rental.to_csv("clean_rental.csv", index=False)